docs/tracking/principles/LANGUAGE_VISION.org
#+TITLE: Prologos Language Vision
#+AUTHOR: Prologos Project
#+DATE: 2026-02-22

* The Elevator Pitch

Prologos (/Πρόλογος/) is a functional-logic language that unifies dependent
types, session types, linear types (QTT), logic programming, and propagators
into a single homoiconic framework. Deep theory hides behind an approachable,
pragmatic surface --- a CS curriculum in a REPL.

* What Problem Does Prologos Solve?

Modern software has four interlocking correctness problems that existing
languages address piecemeal:

1. *Data correctness*: Values satisfy invariants (length-indexed vectors,
   sorted lists, non-empty collections). Dependent types solve this.

2. *Resource correctness*: Resources are used exactly as intended --- no
   double-free, no use-after-close, no leaked file handles. Linear types
   (QTT) solve this.

3. *Protocol correctness*: Communicating processes follow agreed-upon
   protocols --- no deadlock, no message mismatch, no stuck channels.
   Session types solve this.

4. *Logical correctness*: Conclusions follow from premises; decisions are
   justified by evidence. Logic programming with proof terms solves this.

No existing language unifies all four. Prologos does, and it does so in a
way that users can adopt incrementally --- start with plain functions, add
types when you need guarantees, add sessions when you need protocols.

* Formal Methods for Everyone

Prologos brings formal methods out of the ivory tower.

** Executable Specifications
The language is formally specified in Maude (10 modules, 33+ integration
tests) before implementation in Racket. The operational semantics are
captured in PLT Redex. This means the language design itself has been
verified for consistency before a line of prototype code was written.

** Proof Search, Not Proof Writing
In Agda or Coq, users must manually construct proof terms. In Prologos, the
logic engine constructs proofs automatically via proof search. You declare
what must be true; the system finds the derivation.

#+begin_src prologos
;; The logic engine finds the proof term automatically
def six-factorial : <(r : Nat) * [Factorial 6N r]>
  factorial 6N
;; => (pair 720 <auto-generated-proof>)
#+end_src

** Derivation Trees as Data
Every proof search produces a derivation tree. These trees are first-class
data that can be inspected, logged, serialized, and audited. This is the
foundation for explainable AI: every decision comes with a
machine-checkable justification.

* Cutting-Edge Research, Accessible Surface

** Pi Calculus (~defproc~) and Session Types (~session~)
Communication protocols are types. A ~session~ declaration specifies the
shape of a conversation between two processes. ~defproc~ implements one
endpoint. The type checker guarantees that both sides agree and that the
protocol terminates (deadlock freedom for binary sessions).

#+begin_src prologos
session VecProtocol (A : Type)
  recv n : Nat
  send v : [Vec A n]
  end

defproc vec-server (A : Type) : [VecProtocol A]
  recv self n : Nat
    solve [goal make-vec A n v] (v : [Vec A n])
      send v self
        stop
#+end_src

Dependent session types allow protocols to depend on runtime values: the
server above sends a vector whose length was determined by the client's
request. This is not possible in standard session type systems.

** Quantitative Type Theory (QTT)
Three multiplicities capture resource usage:

| Multiplicity | Symbol | Meaning |
|--------------+--------+--------------------------------|
| Erased | ~:0~ | Type-level only, gone at runtime |
| Linear | ~:1~ | Used exactly once |
| Unrestricted | ~:w~ | Used any number of times |

This is simpler than Rust's ownership/borrowing rules (three symbols vs. a
borrow checker) while providing equivalent safety guarantees for the
patterns it covers.

#+begin_src prologos
spec transfer : [coin :1 Coin] Address -> Coin
defn transfer [coin recipient]
  {:value coin.value :owner recipient}

;; TYPE ERROR: Linear variable 'coin' (:1) consumed more than once
spec double-spend : [coin :1 Coin] Address Address -> [Coin * Coin]
defn double-spend [coin alice bob]
  [transfer coin alice] [transfer coin bob]
#+end_src

** Posit Arithmetic (2022 Standard)
Prologos uses exact arithmetic by default (~Int~, ~Rat~) and Posit numbers
for approximate computation. Posits provide tapered precision --- more bits
near 1.0, fewer at extremes --- and a single ~NaR~ (Not a Real) instead of
IEEE 754's zoo of NaN/Inf values. IEEE floats are available for FFI
interop but are not the default.

** Propagator Networks
Type inference, constraint solving, and runtime coordination all use the
same underlying model: lattice-theoretic propagator networks. Cells hold
partial information; propagators refine it monotonically toward a fixed
point. This unifies:

- Type inference (metavariable cells, unification propagators)
- Session type verification (protocol state cells, transition propagators)
- Runtime concurrency (LVar cells, process propagators)
- Logic programming (substitution cells, unification propagators)

* The Three Languages in One

Prologos fuses three paradigms, each with its own visual sigil:

| Paradigm | Syntax | Keyword | Anonymous Form |
|----------------+--------+-----------+----------------|
| Functional | ~[...]~ | ~defn~ | ~fn~ |
| Relational | ~(...)~ | ~defr~ | ~rel~ |
| Process | indent | ~defproc~ | ~proc~ |

The fusion is not superficial --- functional results can trigger logic
search, logic solutions can drive process decisions, and process outcomes
can be typed with dependent types that refer to logical predicates.

#+begin_src prologos
;; Functional defines computation
spec find-path : Graph Node Node -> [List Node]?

;; Relational defines the search space
defn find-path [graph start end]
  let reachable := (rel [?from ?to ?path]
    &> (= from to) (= path '[to | nil])
    &> (edge from mid) (reachable mid to rest)
       (= path '[from | rest]))
  match (solve (reachable start end p))
    | [some path] -> [just path]
    | none -> nothing
#+end_src

* Excellent Error Reporting

Error messages are not an afterthought. Prologos aims for errors that:

1. *Identify the exact location* of the problem (source spans, not just line numbers)
2. *Explain the constraint* that was violated, in human terms
3. *Show both sides* of a type mismatch (expected vs. actual)
4. *Suggest a fix* when one is mechanically derivable
5. *Use standardized codes* (E1001, E1002, E1003, ...) for searchability

#+begin_example
E1003: Linear variable consumed more than once
  ┌─ src/wallet.prologos:14:3
  │
13│ defn double-spend [coin :1 Coin, alice, bob]
14│   [transfer coin alice] [transfer coin bob]
  │             ^^^^                  ^^^^
  │             │                     │
  │             │                     second use here
  │             first use here
  │
  = help: change multiplicity to :w if multiple uses are intended
  = note: :1 means the value must be consumed exactly once
#+end_example

* Excellent FFI Through ~foreign~

Interop with host languages should feel seamless, not foreign:

- ~foreign~ blocks declare external functions with Prologos type signatures
- The runtime handles marshalling automatically
- Type annotations on foreign functions are checked at the boundary
- Qualified namespaces prevent naming collisions
- Goal: calling a Racket/Rust/JS function should feel as natural as calling
  a Prologos function

* Where Prologos Sits

|                     | Prologos | Haskell | Idris 2 | Rust | Prolog | Erlang |
|---------------------+----------+---------+---------+------+--------+--------|
| Dependent types     | Full     | Partial | Full    | No   | No     | No     |
| Linear types (QTT)  | Full     | Linear  | Full    | Own  | No     | No     |
| Session types       | Full     | Lib     | Lib     | No   | No     | RT     |
| Logic programming   | Native   | No      | No      | No   | Native | No     |
| Propagators         | Core     | No      | No      | No   | No     | No     |
| Homoiconicity       | Strong   | No      | No      | No   | Weak   | No     |
| Proof automation    | Native   | No      | Partial | No   | Impl.  | No     |
| Protocol safety     | Static   | No      | Static  | No   | No     | RT     |

(Own = ownership/borrowing; RT = runtime only; Lib = library, not native)

* Editor-Assisted Interactive Development

Prologos aspires to a development experience where the type system is not a
gatekeeper but a /collaborator/. We call this vision *Editor-Assisted
Interactive Development* (EAID).

** The Workflow

1. *Write a spec* --- type signature, documentation, examples, properties.
   The spec captures what the function /means/ before any implementation exists.

2. *Write a skeleton* --- the function definition with ~??~ holes marking
   unknown parts. The programmer writes what they know; holes mark what they
   don't.

3. *Ask for help* --- press a key command. The type system analyzes each hole:
   what type is expected, what bindings are in scope, what constructions are
   possible. Dependent types constrain the search space dramatically.

4. *Refine* --- select a suggestion or refine manually. New sub-holes may
   appear. Repeat until all holes are filled.

5. *Validate* --- the spec's properties and examples are checked automatically.
   The implementation is verified against the spec without writing separate
   tests.

** Inspiration

This model draws from:

- *Agda*: Hole-driven development (~?~ holes, ~C-c C-r~ refine, ~C-c C-c~
  case split, ~C-c C-a~ auto). The gold standard for interactive dependent type
  programming.

- *Idris 2*: Interactive editing (~:ac~ add clause, ~:cs~ case split, ~:ps~
  proof search). Idris's case splitting removes /impossible/ cases via
  unification --- the type system prunes the search space.

- *Clojure Spec*: ~s/fdef~ with ~:args~, ~:ret~, ~:fn~ --- generative testing
  driven by specifications, not manual test authoring.

- *PropEr (Erlang)*: Type-driven generator synthesis. Types as generators.

** The Logic Engine Works for You, Invisibly

The long-term vision: developers benefit from auto-generated tests, intelligent
fuzzing, contract verification, property discovery, and exhaustive case checking
--- without learning proof theory. The logic engine (propagator-based constraint
solving) works behind the scenes, surfacing results through the spec interface.

#+begin_src prologos
spec reverse {A : Type} [List A] -> [List A]
  :properties
    - :name "involution"
      :forall {xs : [List A]}
      :holds [eq? [reverse [reverse xs]] xs]

defn reverse
  | [nil]        -> nil
  | [[cons h t]] -> ??
  ;; The system suggests: [append [reverse t] [cons h nil]]
  ;; because it knows:
  ;;   ?? : [List A]
  ;;   h : A, t : [List A], reverse : [List A] -> [List A]
  ;;   [cons h nil] : [List A], [append _ _] : [List A] -> [List A] -> [List A]
#+end_src

** Surface Language as Domain Vocabulary

The ultimate goal: programmers never need to see Pi or Sigma types unless they
choose to. The surface language provides five abstraction keywords that together
cover the full design space:

- ~spec~ describes functions through metadata
- ~trait~ / ~bundle~ describe interfaces and their groupings
- ~property~ describes propositions and their compositions
- ~functor~ describes type abstractions and their algebraic structure

Each keyword carries structured metadata. The formal type theory (Pi, Sigma,
universe levels, multiplicities) exists in ~:unfolds~ blocks, in the elaborator,
and in error messages (on demand). The programmer's daily interface is domain
vocabulary expressed through keywords and maps.

* Long-Term Aspirations

** Self-Hosting
The Racket prototype (Phase 0) is a stepping stone. The goal is a
self-hosted compiler where the type checker, optimizer, and code generator
are themselves Prologos programs --- enabled by homoiconicity.

** Relational Query Language for Data
The relational paradigm (~defr~/~rel~/~solve~) is not just a logic programming
feature --- it is a graph-query database language in its own right. Prolog facts
are isomorphic to database tables; rules are composable views; subgoals are
joins. Empirical benchmarks show in-memory logic queries returning in sub-ms
where equivalent SQLite queries take 30ms. With tabling as materialized views,
propagators as incremental view maintenance, and ATMS as provenance tracking,
Prologos has the infrastructure for a serious data query platform. See
[[file:RELATIONAL_LANGUAGE_VISION.org][Relational Language Vision § Relations as a Graph-Query Database Language]]
for the full analysis and design implications.

** Embeddable Logic Engine
Ship the propagator-based logic engine as an embeddable library (like
Lua or SQLite) callable from Python, JavaScript, and Rust. Projects don't
need to adopt the full language to benefit from its constraint solving.

** AI Agent Infrastructure
The killer application: multi-agent orchestration where agents communicate
via session-typed protocols, reason via proof search, and explain their
decisions via derivation trees. Prologos as the /language for certified
concurrent reasoning/.

** A Language to Live In and Grow With
Start simple, discover depth. A working programmer can be productive with
~defn~ and ~spec~ in an afternoon. Over months and years, the same
programmer discovers dependent types, session types, logic programming ---
each unlocking new capabilities without invalidating prior knowledge.
A CS curriculum embedded in a language.
