docs/tracking/principles/LANGUAGE_VISION.md
- [The Elevator Pitch](#orgfd17594)
- [What Problem Does Prologos Solve?](#orga5a3d0a)
- [Formal Methods for Everyone](#orge5f8580)
  - [Executable Specifications](#org4622dcc)
  - [Proof Search, Not Proof Writing](#org9481843)
  - [Derivation Trees as Data](#orgd32a38c)
- [Cutting-Edge Research, Accessible Surface](#org80d6684)
  - [Pi Calculus (`defproc`) and Session Types (`session`)](#orge71e07c)
  - [Quantitative Type Theory (QTT)](#org8dbe6fd)
  - [Posit Arithmetic (2022 Standard)](#org08fb9b1)
  - [Propagator Networks](#org6ba735c)
- [The Three Languages in One](#org7b82287)
- [Excellent Error Reporting](#orgc8ec9cd)
- [Excellent FFI Through `foreign`](#org69f7aaa)
- [Where Prologos Sits](#org4f67838)
- [Editor-Assisted Interactive Development](#org7708970)
  - [The Workflow](#org179ce44)
  - [Inspiration](#orgd39a26f)
  - [The Logic Engine Works for You, Invisibly](#org108102d)
  - [Surface Language as Domain Vocabulary](#orgb3b8dc0)
- [Long-Term Aspirations](#org65acaad)
  - [Self-Hosting](#orgff8ea2f)
  - [Relational Query Language for Data](#org937b3a4)
  - [Embeddable Logic Engine](#orgea68f79)
  - [AI Agent Infrastructure](#org3e30881)
  - [A Language to Live In and Grow With](#orgc745d87)



<a id="orgfd17594"></a>

# The Elevator Pitch

Prologos (*Πρόλογος*) is a functional-logic language that unifies dependent types, session types, linear types (QTT), logic programming, and propagators into a single homoiconic framework. Deep theory hides behind an approachable, pragmatic surface &#x2014; a CS curriculum in a REPL.


<a id="orga5a3d0a"></a>

# What Problem Does Prologos Solve?

Modern software has four interlocking correctness problems that existing languages address piecemeal:

1.  **Data correctness**: Values satisfy invariants (length-indexed vectors, sorted lists, non-empty collections). Dependent types solve this.

2.  **Resource correctness**: Resources are used exactly as intended &#x2014; no double-free, no use-after-close, no leaked file handles. Linear types (QTT) solve this.

3.  **Protocol correctness**: Communicating processes follow agreed-upon protocols &#x2014; no deadlock, no message mismatch, no stuck channels. Session types solve this.

4.  **Logical correctness**: Conclusions follow from premises; decisions are justified by evidence. Logic programming with proof terms solves this.

5.  **Authority correctness**: Code can only perform effects it was explicitly granted permission for &#x2014; no ambient authority, no confused deputies, no privilege escalation. Capability security (QTT + dependent types + session types) solves this. See [Capability Security](CAPABILITY_SECURITY.md).

No existing language unifies all five. Prologos does, and it does so in a way that users can adopt incrementally &#x2014; start with plain functions, add types when you need guarantees, add sessions when you need protocols, add capabilities when you need authority control.


<a id="orge5f8580"></a>

# Formal Methods for Everyone

Prologos brings formal methods out of the ivory tower.


<a id="org4622dcc"></a>

## Executable Specifications

The language is formally specified in Maude (10 modules, 33+ integration tests) before implementation in Racket. The operational semantics are captured in PLT Redex. This means the language design itself has been verified for consistency before a line of prototype code was written.


<a id="org9481843"></a>

## Proof Search, Not Proof Writing

In Agda or Coq, users must manually construct proof terms. In Prologos, the logic engine constructs proofs automatically via proof search. You declare what must be true; the system finds the derivation.

```prologos
;; The logic engine finds the proof term automatically
def six-factorial : <(r : Nat) * [Factorial 6N r]>
  factorial 6N
;; => (pair 720 <auto-generated-proof>)
```


<a id="orgd32a38c"></a>

## Derivation Trees as Data

Every proof search produces a derivation tree. These trees are first-class data that can be inspected, logged, serialized, and audited. This is the foundation for explainable AI: every decision comes with a machine-checkable justification.


<a id="org80d6684"></a>

# Cutting-Edge Research, Accessible Surface


<a id="orge71e07c"></a>

## Pi Calculus (`defproc`) and Session Types (`session`)

Communication protocols are types. A `session` declaration specifies the shape of a conversation between two processes. `defproc` implements one endpoint. The type checker guarantees that both sides agree and that the protocol terminates (deadlock freedom for binary sessions).

```prologos
session VecProtocol (A : Type)
  recv n : Nat
  send v : [Vec A n]
  end

defproc vec-server (A : Type) : [VecProtocol A]
  recv self n : Nat
    solve [goal make-vec A n v] (v : [Vec A n])
      send v self
        stop
```

Dependent session types allow protocols to depend on runtime values: the server above sends a vector whose length was determined by the client's request. This is not possible in standard session type systems.


<a id="org8dbe6fd"></a>

## Quantitative Type Theory (QTT)

Three multiplicities capture resource usage:

| Multiplicity | Symbol | Meaning                          |
|------------ |------ |-------------------------------- |
| Erased       | `:0`   | Type-level only, gone at runtime |
| Linear       | `:1`   | Used exactly once                |
| Unrestricted | `:w`   | Used any number of times         |

This is simpler than Rust's ownership/borrowing rules (three symbols vs. a borrow checker) while providing equivalent safety guarantees for the patterns it covers.

```prologos
spec transfer : [coin :1 Coin] Address -> Coin
defn transfer [coin recipient]
  {:value coin.value :owner recipient}

;; TYPE ERROR: Linear variable 'coin' (:1) consumed more than once
spec double-spend : [coin :1 Coin] Address Address -> [Coin * Coin]
defn double-spend [coin alice bob]
  [transfer coin alice] [transfer coin bob]
```


<a id="org08fb9b1"></a>

## Posit Arithmetic (2022 Standard)

Prologos uses exact arithmetic by default (`Int`, `Rat`) and Posit numbers for approximate computation. Posits provide tapered precision &#x2014; more bits near 1.0, fewer at extremes &#x2014; and a single `NaR` (Not a Real) instead of IEEE 754's zoo of NaN/Inf values. IEEE floats are available for FFI interop but are not the default.


<a id="org6ba735c"></a>

## Propagator Networks

Type inference, constraint solving, and runtime coordination all use the same underlying model: lattice-theoretic propagator networks. Cells hold partial information; propagators refine it monotonically toward a fixed point. This unifies:

-   Type inference (metavariable cells, unification propagators)
-   Session type verification (protocol state cells, transition propagators)
-   Runtime concurrency (LVar cells, process propagators)
-   Logic programming (substitution cells, unification propagators)


<a id="org7b82287"></a>

# The Three Languages in One

Prologos fuses three paradigms, each with its own visual sigil:

| Paradigm   | Syntax  | Keyword   | Anonymous Form |
|---------- |------- |--------- |-------------- |
| Functional | `[...]` | `defn`    | `fn`           |
| Relational | `(...)` | `defr`    | `rel`          |
| Process    | indent  | `defproc` | `proc`         |

The fusion is not superficial &#x2014; functional results can trigger logic search, logic solutions can drive process decisions, and process outcomes can be typed with dependent types that refer to logical predicates.

```prologos
;; Functional defines computation
spec find-path : Graph Node Node -> [List Node]?

;; Relational defines the search space
defn find-path [graph start end]
  let reachable := (rel [?from ?to ?path]
    &> (= from to) (= path '[to | nil])
    &> (edge from mid) (reachable mid to rest)
       (= path '[from | rest]))
  match (solve (reachable start end p))
    | [some path] -> [just path]
    | none -> nothing
```


<a id="orgc8ec9cd"></a>

# Excellent Error Reporting

Error messages are not an afterthought. Prologos aims for errors that:

1.  **Identify the exact location** of the problem (source spans, not just line numbers)
2.  **Explain the constraint** that was violated, in human terms
3.  **Show both sides** of a type mismatch (expected vs. actual)
4.  **Suggest a fix** when one is mechanically derivable
5.  **Use standardized codes** (E1001, E1002, E1003, &#x2026;) for searchability

```
E1003: Linear variable consumed more than once
  ┌─ src/wallet.prologos:14:3
  │
13│ defn double-spend [coin :1 Coin, alice, bob]
14│   [transfer coin alice] [transfer coin bob]
  │             ^^^^                  ^^^^
  │             │                     │
  │             │                     second use here
  │             first use here
  │
  = help: change multiplicity to :w if multiple uses are intended
  = note: :1 means the value must be consumed exactly once
```


<a id="org69f7aaa"></a>

# Excellent FFI Through `foreign`

Interop with host languages should feel seamless, not foreign:

-   `foreign` blocks declare external functions with Prologos type signatures
-   The runtime handles marshalling automatically
-   Type annotations on foreign functions are checked at the boundary
-   Qualified namespaces prevent naming collisions
-   Goal: calling a Racket/Rust/JS function should feel as natural as calling a Prologos function


<a id="org4f67838"></a>

# Where Prologos Sits

|                    | Prologos | Haskell | Idris 2 | Rust | Prolog | Erlang |
|------------------ |-------- |------- |------- |---- |------ |------ |
| Dependent types    | Full     | Partial | Full    | No   | No     | No     |
| Linear types (QTT) | Full     | Linear  | Full    | Own  | No     | No     |
| Session types      | Full     | Lib     | Lib     | No   | No     | RT     |
| Logic programming  | Native   | No      | No      | No   | Native | No     |
| Propagators        | Core     | No      | No      | No   | No     | No     |
| Homoiconicity      | Strong   | No      | No      | No   | Weak   | No     |
| Proof automation   | Native   | No      | Partial | No   | Impl.  | No     |
| Protocol safety    | Static   | No      | Static  | No   | No     | RT     |
| Capability security| Static   | No      | No      | No   | No     | No     |

(Own = ownership/borrowing; RT = runtime only; Lib = library, not native; see [Capability Security](CAPABILITY_SECURITY.md))


<a id="org7708970"></a>

# Editor-Assisted Interactive Development

Prologos aspires to a development experience where the type system is not a gatekeeper but a *collaborator*. We call this vision **Editor-Assisted Interactive Development** (EAID).


<a id="org179ce44"></a>

## The Workflow

1.  **Write a spec** &#x2014; type signature, documentation, examples, properties. The spec captures what the function *means* before any implementation exists.

2.  **Write a skeleton** &#x2014; the function definition with `??` holes marking unknown parts. The programmer writes what they know; holes mark what they don't.

3.  **Ask for help** &#x2014; press a key command. The type system analyzes each hole: what type is expected, what bindings are in scope, what constructions are possible. Dependent types constrain the search space dramatically.

4.  **Refine** &#x2014; select a suggestion or refine manually. New sub-holes may appear. Repeat until all holes are filled.

5.  **Validate** &#x2014; the spec's properties and examples are checked automatically. The implementation is verified against the spec without writing separate tests.


<a id="orgd39a26f"></a>

## Inspiration

This model draws from:

-   **Agda**: Hole-driven development (`?` holes, `C-c C-r` refine, `C-c C-c` case split, `C-c C-a` auto). The gold standard for interactive dependent type programming.

-   **Idris 2**: Interactive editing (`:ac` add clause, `:cs` case split, `:ps` proof search). Idris's case splitting removes *impossible* cases via unification &#x2014; the type system prunes the search space.

-   **Clojure Spec**: `s/fdef` with `:args`, `:ret`, `:fn` &#x2014; generative testing driven by specifications, not manual test authoring.

-   **PropEr (Erlang)**: Type-driven generator synthesis. Types as generators.


<a id="org108102d"></a>

## The Logic Engine Works for You, Invisibly

The long-term vision: developers benefit from auto-generated tests, intelligent fuzzing, contract verification, property discovery, and exhaustive case checking &#x2014; without learning proof theory. The logic engine (propagator-based constraint solving) works behind the scenes, surfacing results through the spec interface.

```prologos
spec reverse {A : Type} [List A] -> [List A]
  :properties
    - :name "involution"
      :forall {xs : [List A]}
      :holds [eq? [reverse [reverse xs]] xs]

defn reverse
  | [nil]        -> nil
  | [[cons h t]] -> ??
  ;; The system suggests: [append [reverse t] [cons h nil]]
  ;; because it knows:
  ;;   ?? : [List A]
  ;;   h : A, t : [List A], reverse : [List A] -> [List A]
  ;;   [cons h nil] : [List A], [append _ _] : [List A] -> [List A] -> [List A]
```


<a id="orgb3b8dc0"></a>

## Surface Language as Domain Vocabulary

The ultimate goal: programmers never need to see Pi or Sigma types unless they choose to. The surface language provides five abstraction keywords that together cover the full design space:

-   `spec` describes functions through metadata
-   `trait` / `bundle` describe interfaces and their groupings
-   `property` describes propositions and their compositions
-   `functor` describes type abstractions and their algebraic structure

Each keyword carries structured metadata. The formal type theory (Pi, Sigma, universe levels, multiplicities) exists in `:unfolds` blocks, in the elaborator, and in error messages (on demand). The programmer's daily interface is domain vocabulary expressed through keywords and maps.


<a id="org65acaad"></a>

# Long-Term Aspirations


<a id="orgff8ea2f"></a>

## Self-Hosting

The Racket prototype (Phase 0) is a stepping stone. The goal is a self-hosted compiler where the type checker, optimizer, and code generator are themselves Prologos programs &#x2014; enabled by homoiconicity.


<a id="org937b3a4"></a>

## Relational Query Language for Data

The relational paradigm (`defr~/~rel~/~solve`) is not just a logic programming feature &#x2014; it is a graph-query database language in its own right. Prolog facts are isomorphic to database tables; rules are composable views; subgoals are joins. Empirical benchmarks show in-memory logic queries returning in sub-ms where equivalent SQLite queries take 30ms. With tabling as materialized views, propagators as incremental view maintenance, and ATMS as provenance tracking, Prologos has the infrastructure for a serious data query platform. See [Relational Language Vision § Relations as a Graph-Query Database Language](RELATIONAL_LANGUAGE_VISION.md) for the full analysis and design implications.


<a id="orgea68f79"></a>

## Embeddable Logic Engine

Ship the propagator-based logic engine as an embeddable library (like Lua or SQLite) callable from Python, JavaScript, and Rust. Projects don't need to adopt the full language to benefit from its constraint solving.


<a id="org3e30881"></a>

## AI Agent Infrastructure

The killer application: multi-agent orchestration where agents communicate via session-typed protocols, reason via proof search, and explain their decisions via derivation trees. Prologos as the *language for certified concurrent reasoning*.


<a id="orgc745d87"></a>

## A Language to Live In and Grow With

Start simple, discover depth. A working programmer can be productive with `defn` and `spec` in an afternoon. Over months and years, the same programmer discovers dependent types, session types, logic programming &#x2014; each unlocking new capabilities without invalidating prior knowledge. A CS curriculum embedded in a language.
